Enums/СтатусыЗаявокНаЗакупку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокНаЗакупку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаВыполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЗаявокНаЗакупку/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	Если Не Параметры.Отбор.Свойство("Автор") // Список ограничивается только при редактировании документа.
		Или ПраваПользователяПовтИсп.СогласованиеЗаявокНаЗакупку() // Согласующий может выполнить любые действия над документом
		Тогда
		Возврат;
	КонецЕсли;
		
	СтандартнаяОбработка = Ложь;
	ИсключаемыеЗначения = Новый Массив;
	ИсключаемыеЗначения.Добавить(НаВыполнении); // Запрет согласования.
	
	Если Параметры.Отбор.Автор <> Пользователи.ТекущийПользователь() Тогда
		// Запрет закрытия.
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИсключаемыеЗначения, КонечныеСтатусы());
	КонецЕсли;
	
	ОбщегоНазначенияУТ.ДоступныеДляВыбораЗначенияПеречисления(
		ПустаяСсылка().Метаданные().Имя,
		ДанныеВыбора,
		Параметры,
		ИсключаемыеЗначения);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДоступныеМаршруты

// Заполнить доступные маршруты статусов (переходы по состояниям) для статусов
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Владелец протокола
Процедура ЗаполнитьДоступныеМаршрутыСтатусов(Форма) Экспорт
	
	ДоступноСогласование = ПраваПользователяПовтИсп.СогласованиеЗаявокНаЗакупку();
	ДоступноЗакрытие = ДоступноСогласование Или Форма.Объект.Автор = Пользователи.ТекущийПользователь();

	#Область НаСогласовании
	
	Если ПраваПользователяПовтИсп.СогласованиеЗаявокНаЗакупку() Тогда
		РаботаСПротоколомДокумента.ДобавитьДоступныйМаршрут(
			Форма,
			НаСогласовании,
			НаВыполнении,
			НСтр("ru = 'Передать на выполнение'"),
			"Менеджер");
	КонецЕсли;

	РаботаСПротоколомДокумента.ДобавитьМаршрутПеренаправления(Форма, НаСогласовании);
	ДобавитьЗакрытие(Форма, НаСогласовании, ДоступноЗакрытие);
	
	#КонецОбласти

	#Область НаВыполнении
	
	ДобавитьЗакрытие(Форма, НаВыполнении, ДоступноЗакрытие);
	
	РаботаСПротоколомДокумента.ДобавитьМаршрутПеренаправления(Форма, НаВыполнении);
	РаботаСПротоколомДокумента.ДобавитьДоступныйМаршрут(
		Форма,
		НаВыполнении,
		НаСогласовании,
		НСтр("ru = 'Вернуть на согласование'"),
		"Ответственный");

	#КонецОбласти

	#Область Закрыта
	
	РаботаСПротоколомДокумента.ДобавитьДоступныйМаршрут(
		Форма,
		Закрыта,
		НаВыполнении,
		НСтр("ru = 'Вернуть в работу'"),
		"Менеджер");
		
	#КонецОбласти
			
КонецПроцедуры

Процедура ДобавитьЗакрытие(Форма, ИсходныйСтатус, ДоступноЗакрытие)
	
	Если Не ДоступноЗакрытие Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСПротоколомДокумента.ДобавитьДоступныйМаршрут(Форма, ИсходныйСтатус, Закрыта, НСтр("ru = 'Закрыть заявку'"));
	
КонецПроцедуры

#КонецОбласти

#Область КонечныеСтатусы

// Это конечный статус.
// 
// Параметры:
//  Статус - ПеречислениеСсылка.СтатусыЗаявокНаЗакупку - проверяемый статус.
// 
// Возвращаемое значение:
//  Булево - Это конечный статус работы над документом
Функция ЭтоКонечныйСтатус(Статус) Экспорт
	
	Возврат КонечныеСтатусы().Найти(Статус) <> Неопределено;
	
КонецФункции

// Конечные статусы работы с документом.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.СтатусыЗаявокНаЗакупку
Функция КонечныеСтатусы() Экспорт
	
	КонечныеСтатусы = Новый Массив;
	КонечныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаЗакупку.Закрыта"));
	
	Возврат КонечныеСтатусы;
	
КонецФункции 

// Это статус прошедший согласование
// 
// Параметры:
//  Статус - ПеречислениеСсылка.СтатусыЗаявокНаЗакупку - Проверяемый статус.
// 
// Возвращаемое значение:
//  Булево
Функция Согласована(Статус) Экспорт
	
	СтатусыПрошедшиеСогласование = Новый Массив;
	
	СтатусыПрошедшиеСогласование.Добавить(НаВыполнении);
	СтатусыПрошедшиеСогласование.Добавить(Закрыта);
	
	Возврат СтатусыПрошедшиеСогласование.Найти(Статус) <> Неопределено 
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
